; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	thermograph3 - mode
	infrared2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 image0)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared2)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(have_image Phenomenon5 image0)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 image0)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Planet10 infrared1)
	(have_image Star11 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 planet10 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet10)
   goals met: 0 of 7
5. (take_image satellite1 planet10 instrument3 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon5 instrument3 image0)
   added: (have_image phenomenon5 image0)
   goals met: 2 of 7
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 7
9. (calibrate satellite0 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 2 of 7
10. (turn_to satellite0 phenomenon6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 7
11. (take_image satellite0 phenomenon6 instrument2 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 3 of 7
12. (turn_to satellite0 star11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star11)
   goals met: 3 of 7
13. (take_image satellite0 star11 instrument2 infrared2)
   added: (have_image star11 infrared2)
   goals met: 4 of 7
14. (turn_to satellite1 planet8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet8)
   goals met: 4 of 7
15. (take_image satellite1 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 5 of 7
16. (turn_to satellite1 star7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star7)
   goals met: 5 of 7
17. (take_image satellite1 star7 instrument3 image0)
   added: (have_image star7 image0)
   goals met: 6 of 7
18. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 6 of 7
19. (take_image satellite1 star9 instrument3 infrared1)
   added: (have_image star9 infrared1)
   goals met: 7 of 7
